"Welcome to Datashield" = "Welcome to Datashield";
"Phone number" = "Phone number";
"I have read and agree the service agreement." = "I have read and agree the service agreement.";
"the service agreement" = "the service agreement";
"One-click Login" = "One-click Login";
"More login methods" = "More login methods";
"Cancel" = "Cancel";
"Agree" = "Agree";
"Logging in..." = "Logging in...";

"Please switch to the mobile network and use the one-click login function" = "Please switch to the mobile network and use the one-click login function";
"Data error, please try again" = "Data error, please try again";
"Network error, please try again later" = "Network error, please try again later" ;

"Login failed, Please choose another login method" = "Login failed, Please choose another login method";
"The entered phone number is not the current network number" = "The entered phone number is not the current network number";
"Please read and agree to the agreement first. I have read and agree to the service agreement" = "Please read and agree to the agreement first. I have read and agree to the service agreement";

"Operator ASI" = "The customer consents to DATASHIELD TECHNOLOGY LIMITED collecting and processing data—including phone number —and authorizes Advanced Info Service Public Company Limited to disclose such information for phone number usage verification during transactions.";
"Operator TRUE" = "The customer authorizes True Move H Universal Communication Co., Ltd. (“True”) to disclose personal data to DATASHIELD TECHNOLOGY LIMITED solely for one-time phone number validation (MSISDN Validation). The customer acknowledges that True has no obligation to retain or further process the data and confirms agreement with True’s Privacy Policy.";
"Operator NT" = "The customer authorizes National Telecom Public Company Limited to disclose personal data to DATASHIELD TECHNOLOGY LIMITED for the sole purpose of phone number (MSISDN) and location verification during transactions. This one-time disclosure is made with the customer’s consent, who acknowledges that National Telecom holds no further obligation regarding data retention or processing, and confirms agreement with National Telecom’s Privacy Policy.";
